ShahinFi/seba-robot/firmware/stm32/src/main.c
#include "stm32g4xx_hal.h"

#include "console/console.h"
#include "current_sensor/current_sensor.h"
#include "encoder/encoder.h"
#include "imu/imu.h"
#include "motor/motor.h"
#include "serial/serial.h"
#include "tests/motor_test.h"

static void SystemClock_Init(void);
static void Error_Handler(void);

int main(void)
{
    HAL_Init();
    SystemClock_Init();

    Motor_Init();
    MotorTest_Init();
    Encoder_Init();

    if (!CurrentSensor_Init())
    {
        Error_Handler();
    }

    /*
     * Serial must be available before initializing the IMU,
     * so initialization errors can be reported.
     */
    if (!Serial_Init())
    {
        Error_Handler();
    }

    Serial_WriteLine("");
    Serial_WriteLine("Initializing IMU...");

    const bool imu_initialized =
        IMU_Init();

    if (imu_initialized)
    {
        Serial_WriteLine(
            "IMU initialization successful."
        );
    }
    else
    {
        Serial_WriteLine(
            "ERROR: IMU initialization failed."
        );
    }

    /*
     * Console input starts after IMU initialization so startup
     * messages cannot interleave with command processing. The
     * console still starts if IMU initialization fails.
     */
    Console_Init();

    while (1)
    {
        Encoder_Update();

        if (imu_initialized)
        {
            IMU_Process();
        }

        Console_Process();
    }
}

static void SystemClock_Init(void)
{
    RCC_OscInitTypeDef oscillator = {0};
    RCC_ClkInitTypeDef clock = {0};

    /*
     * Peripheral timing constants are based on a 16 MHz HSI
     * system clock with no PLL.
     */
    oscillator.OscillatorType =
        RCC_OSCILLATORTYPE_HSI;

    oscillator.HSIState =
        RCC_HSI_ON;

    oscillator.HSICalibrationValue =
        RCC_HSICALIBRATION_DEFAULT;

    oscillator.PLL.PLLState =
        RCC_PLL_NONE;

    if (HAL_RCC_OscConfig(
            &oscillator
        ) != HAL_OK)
    {
        Error_Handler();
    }

    clock.ClockType =
        RCC_CLOCKTYPE_SYSCLK |
        RCC_CLOCKTYPE_HCLK |
        RCC_CLOCKTYPE_PCLK1 |
        RCC_CLOCKTYPE_PCLK2;

    clock.SYSCLKSource =
        RCC_SYSCLKSOURCE_HSI;

    clock.AHBCLKDivider =
        RCC_SYSCLK_DIV1;

    clock.APB1CLKDivider =
        RCC_HCLK_DIV1;

    clock.APB2CLKDivider =
        RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(
            &clock,
            FLASH_LATENCY_0
        ) != HAL_OK)
    {
        Error_Handler();
    }
}

static void Error_Handler(void)
{
    /*
     * Motor_Init() runs before any fallible peripheral setup,
     * so error handling can always force the drivers off.
     */
    Motor_StopAll();
    Motor_Disable();

    while (1)
    {
    }
}

/*
 * Required for HAL_Delay() and HAL timeout handling in this
 * PlatformIO STM32Cube project.
 */
void SysTick_Handler(void)
{
    HAL_IncTick();
}
